In [5]:
import pandas as pd
data = {
    "student":["Bob","Swetanshu","Alex","Alan"],
    "Marks":[10,80,95,98]}
df=pd.DataFrame(data)
print(df)

     student  Marks
0        Bob     10
1  Swetanshu     80
2       Alex     95
3       Alan     98

In [7]:
#show the first 5 rows 
df.head()

     student  Marks
0        Bob     10
1  Swetanshu     80
2       Alex     95
3       Alan     98

In [9]:
#show the last 5 rows
df.tail()

     student  Marks
0        Bob     10
1  Swetanshu     80
2       Alex     95
3       Alan     98

In [13]:
#show the rows and colomns 
df.shape

(4, 2)

In [17]:
#retrive the colomn name 
df.columns

Index(['student', 'Marks'], dtype='object')

In [19]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [21]:
# Summary: data types, non-null counts 
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   student  4 non-null      object
 1   Marks    4 non-null      int64
dtypes: int64(1), object(1)
memory usage: 196.0+ bytes

In [23]:
# Stats: mean, min, max, std (numerical columns only) or print the stats summary 
df.describe()

           Marks
count   4.000000
mean   70.750000
std    41.258332
min    10.000000
25%    62.500000
50%    87.500000
75%    95.750000
max    98.000000

In [27]:
#Now accesss a colomn 
df["student"]

0          Bob
1    Swetanshu
2         Alex
3         Alan
Name: student, dtype: object

In [29]:
df[["student","Marks"]]

     student  Marks
0        Bob     10
1  Swetanshu     80
2       Alex     95
3       Alan     98

In [31]:
#find wwhat is in the last row 
df.iloc[-1]

student    Alan
Marks        98
Name: 3, dtype: object

In [33]:
#find the marks of the student 
df.loc[2,"Marks"]

95

In [35]:
#filter the data for more than 80
df[df["Marks"]>80]

  student  Marks
2    Alex     95
3    Alan     98

In [41]:
#add a colomn for pass and fail
import numpy as np
df["result"]=np.where(df["Marks"]>=50,"Pass","Fail")
print(df)

     student  Marks result
0        Bob     10   Fail
1  Swetanshu     80   Pass
2       Alex     95   Pass
3       Alan     98   Pass

In [43]:
import numpy as np
arr_1d=np.array([1,2,3,4])
print(arr_1d)

[1 2 3 4]

In [ ]:
arr_2d=np.arr